{
  "source_language": "es",
  "corpus": "A tales efectos se entenderá excluida del ámbito laboral la actividad de las personas prestadoras del servicio de transporte al amparo de autorizaciones administrativas de las que sean titulares, realizada, mediante el correspondiente precio, con vehículos comerciales de servicio público cuya propiedad o poder directo de disposición ostenten, aun cuando dichos servicios se realicen de forma continuada para un mismo cargador o comercializador.  4. La legislación laboral española será de aplicación al trabajo que presten los trabajadores españoles contratados en España al servicio de empresas españolas en el extranjero, sin perjuicio de las normas de orden público aplicables en el lugar de trabajo. Dichos trabajadores tendrán, al menos, los derechos económicos que les corresponderían de trabajar en territorio español.  5. A efectos de esta ley se considera centro de trabajo la unidad productiva con organización específica, que sea dada de alta, como tal, ante la autoridad laboral.  En la actividad de trabajo en el mar se considerará como centro de trabajo el buque, entendiéndose situado en la provincia donde radique su puerto de base.  Artículo 2. Relaciones laborales de carácter especial. 1. Se considerarán relaciones laborales de carácter especial:  a) La del personal de alta dirección no incluido en el artículo 1.3.c).  b) La del servicio del hogar familiar.  c) La de los penados en las instituciones penitenciarias.  d) La de los deportistas profesionales.  e) La de los artistas en espectáculos públicos.  f) La de las personas que intervengan en operaciones mercantiles por cuenta de uno o más empresarios sin asumir el riesgo y ventura de aquellas.  g) La de los trabajadores con discapacidad que presten sus servicios en los centros especiales de empleo.  h) (Derogada)  i) La de los menores sometidos a la ejecución de medidas de internamiento para el cumplimiento de su responsabilidad penal.  j) La de residencia para la formación de especialistas en Ciencias de la Salud.  k) La de los abogados que prestan servicios en despachos de abogados, individuales o colectivos.  l) Cualquier otro trabajo que sea expresamente declarado como relación laboral de carácter especial por una ley.  2. En todos los supuestos señalados en el apartado anterior, la regulación de dichas relaciones laborales respetará los derechos básicos reconocidos por la Constitución.  Artículo 3. Fuentes de la relación laboral. 1. Los derechos y obligaciones concernientes a la relación laboral se regulan:  a) Por las disposiciones legales y reglamentarias del Estado.  b) Por los convenios colectivos.  c) Por la voluntad de las partes, manifestada en el contrato de trabajo, siendo su objeto lícito y sin que en ningún caso puedan establecerse en perjuicio del trabajador condiciones menos favorables o contrarias a las disposiciones legales y convenios colectivos antes expresados.  d) Por los usos y costumbres locales y profesionales.  2. Las disposiciones legales y reglamentarias se aplicarán con sujeción estricta al principio de jerarquía normativa. Las disposiciones reglamentarias desarrollarán los preceptos que establecen las normas de rango superior, pero no podrán establecer condiciones de trabajo distintas a las establecidas por las leyes a desarrollar.  3. Los conflictos originados entre los preceptos de dos o más normas laborales, tanto estatales como pactadas, que deberán respetar en todo caso los mínimos de derecho necesario, se resolverán mediante la aplicación de lo más favorable para el trabajador apreciado en su conjunto, y en cómputo anual, respecto de los conceptos cuantificables.  4. Los usos y costumbres solo se aplicarán en defecto de disposiciones legales, convencionales o contractuales, a no ser que cuenten con una recepción o remisión expresa.  5. Los trabajadores no podrán disponer válidamente, antes o después de su adquisición, de los derechos que tengan reconocidos por disposiciones legales de derecho necesario."
}
